<?php
/**
 * The template for displaying the footer
 *
 * Contains the closing of the #content div and all content after.
 *
 * @link https://developer.wordpress.org/themes/basics/template-files/#template-partials
 *
 * @package WordPress
 * @subpackage Twenty_Nineteen
 * @since Twenty Nineteen 1.0
 */

?>

</div><!-- #content -->

<footer class="footer ">
	<div class="container">
		<div class="footer__content flex">
			<div class="footer__group flex">
				<img src="<?php echo get_field('footer_logo', 'option'); ?>" alt="">
				<a href="<?php echo get_field('policy_link', 'option'); ?>" class="policy">Политика конфеденциальности</a>
				<div class="footer__descr">
					Предоставленная вами  персональная информация используется для обработки заказа. Ваши данные не будут разглашены и не будут переданы третьим лицам.  
				</div>
			</div>
			<div class="footer__group">
				<?php 
                    wp_nav_menu( array(
                        'theme_location'=> 'footer',
                        'menu_class'        => 'footer__nav flex', // класс элемента <ul>
                        'container'         => false, // тег контейнера или false, если контейнер не нужен
                        'echo'              => true, // вывести или вернуть
                        'depth'             => 1, // количество уровней вложенности
                    ) );
                ?>
			</div>
			<div class="footer__group flex">
				<div class="footer__address flex">
					<a href="mailto:<?php echo get_field('header_mail', 'option'); ?>"><?php echo get_field('header_mail', 'option'); ?></a>
					<?php 
					if( have_rows('header_tel', 'option') ) {
						while( have_rows('header_tel', 'option') ) {
							the_row();
							$tel_link = get_sub_field('header-tel_link');
							$tel_tel = get_sub_field('header-tel_tel');
					?>
					<a href="tel:<?php echo $tel_link; ?>"><?php echo $tel_tel; ?></a>
					<?php } } ?>
				</div>
				<div class="footer__soc flex">
					<?php 
					if( have_rows('socials', 'option') ) {
						while( have_rows('socials', 'option') ) {
							the_row();
					?>
					<?php if(get_sub_field('wa_link')) { ?>
					<a href="<?php echo get_sub_field('wa_link'); ?>">
						<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
							<rect width="48" height="48" rx="24" fill="#0DC143"/>
							<path d="M34.7504 13.2115C32.1775 10.5628 28.6207 9.125 24.9883 9.125C17.2694 9.125 11.064 15.4061 11.1396 23.0493C11.1396 25.4709 11.8207 27.8169 12.9558 29.9358L10.9883 37.125L18.3288 35.2331C20.3721 36.3682 22.6423 36.898 24.9126 36.898C32.5558 36.898 38.7613 30.6169 38.7613 22.9736C38.7613 19.2655 37.3234 15.7845 34.7504 13.2115ZM24.9883 34.552C22.945 34.552 20.9018 34.0223 19.1613 32.9628L18.7072 32.7358L14.318 33.8709L15.4531 29.5574L15.1504 29.1034C11.8207 23.7304 13.4099 16.6169 18.8586 13.2872C24.3072 9.95743 31.345 11.5466 34.6748 16.9953C38.0045 22.4439 36.4153 29.4818 30.9667 32.8115C29.2261 33.9466 27.1072 34.552 24.9883 34.552ZM31.6477 26.152L30.8153 25.7736C30.8153 25.7736 29.6045 25.2439 28.8477 24.8655C28.7721 24.8655 28.6964 24.7899 28.6207 24.7899C28.3937 24.7899 28.2423 24.8655 28.091 24.9412C28.091 24.9412 28.0153 25.0169 26.9558 26.2277C26.8802 26.3791 26.7288 26.4547 26.5775 26.4547H26.5018C26.4261 26.4547 26.2748 26.3791 26.1991 26.3034L25.8207 26.152C24.9883 25.7736 24.2315 25.3196 23.6261 24.7142C23.4748 24.5628 23.2477 24.4115 23.0964 24.2601C22.5667 23.7304 22.0369 23.125 21.6586 22.4439L21.5829 22.2926C21.5072 22.2169 21.5072 22.1412 21.4315 21.9899C21.4315 21.8385 21.4315 21.6872 21.5072 21.6115C21.5072 21.6115 21.8099 21.2331 22.0369 21.0061C22.1883 20.8547 22.264 20.6277 22.4153 20.4764C22.5667 20.2493 22.6423 19.9466 22.5667 19.7196C22.491 19.3412 21.5829 17.298 21.3558 16.8439C21.2045 16.6169 21.0531 16.5412 20.8261 16.4655H20.5991C20.4477 16.4655 20.2207 16.4655 19.9937 16.4655C19.8423 16.4655 19.691 16.5412 19.5396 16.5412L19.464 16.6169C19.3126 16.6926 19.1613 16.8439 19.0099 16.9196C18.8586 17.0709 18.7829 17.2223 18.6315 17.3736C18.1018 18.0547 17.7991 18.8872 17.7991 19.7196C17.7991 20.325 17.9504 20.9304 18.1775 21.4601L18.2531 21.6872C18.9342 23.125 19.8423 24.4115 21.0531 25.5466L21.3558 25.8493C21.5829 26.0764 21.8099 26.2277 21.9613 26.4547C23.5504 27.8169 25.3667 28.8007 27.4099 29.3304C27.6369 29.4061 27.9396 29.4061 28.1667 29.4818C28.3937 29.4818 28.6964 29.4818 28.9234 29.4818C29.3018 29.4818 29.7558 29.3304 30.0586 29.1791C30.2856 29.0277 30.4369 29.0277 30.5883 28.8764L30.7396 28.725C30.891 28.5736 31.0423 28.498 31.1937 28.3466C31.345 28.1953 31.4964 28.0439 31.5721 27.8926C31.7234 27.5899 31.7991 27.2115 31.8748 26.8331C31.8748 26.6818 31.8748 26.4547 31.8748 26.3034C31.8748 26.3034 31.7991 26.2277 31.6477 26.152Z" fill="white"/>
						</svg>
					</a>
					<?php } ?>
					<?php if(get_sub_field('tg_link')) { ?>
					<a href="<?php echo get_sub_field('tg_link'); ?>">
						<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
							<rect width="48" height="48" rx="24" fill="#419FD9"/>
							<rect width="48" height="48" rx="24" fill="url(#paint0_linear_846_2123)"/>
							<path d="M10.7874 23.4709C17.7667 20.3663 22.4206 18.3195 24.7493 17.3305C31.3979 14.507 32.7795 14.0165 33.68 14.0002C33.878 13.9968 34.3208 14.0469 34.6077 14.2845C34.8499 14.4852 34.9165 14.7563 34.9484 14.9465C34.9803 15.1368 35.02 15.5702 34.9884 15.9088C34.6281 19.774 33.0692 29.1539 32.276 33.483C31.9404 35.3148 31.2796 35.929 30.6399 35.9891C29.2496 36.1197 28.1938 35.051 26.8473 34.1497C24.7401 32.7394 23.5498 31.8615 21.5044 30.4854C19.1407 28.895 20.673 28.0209 22.0201 26.5923C22.3726 26.2184 28.4983 20.5295 28.6169 20.0135C28.6317 19.9489 28.6455 19.7083 28.5055 19.5813C28.3655 19.4543 28.1589 19.4977 28.0098 19.5322C27.7985 19.5812 24.4323 21.8529 17.9113 26.3473C16.9558 27.0172 16.0904 27.3435 15.315 27.3264C14.4602 27.3076 12.8159 26.833 11.5935 26.4273C10.0942 25.9296 8.90254 25.6666 9.0063 24.8215C9.06035 24.3813 9.65403 23.9311 10.7874 23.4709Z" fill="white"/>
							<defs>
								<linearGradient id="paint0_linear_846_2123" x1="24" y1="0" x2="24" y2="47.6438" gradientUnits="userSpaceOnUse">
									<stop stop-color="#2AABEE"/>
									<stop offset="1" stop-color="#229ED9"/>
								</linearGradient>
							</defs>
						</svg>
					</a>
					<?php } ?>
					<?php if(get_sub_field('fc_link')) { ?>
					<a href="<?php echo get_sub_field('fc_link'); ?>">
						<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
							<rect width="48" height="48" rx="24" fill="#4267B2"/>
							<path d="M25.6029 39.9998V25.4031H30.5025L31.236 19.7145H25.6029V16.0825C25.6029 14.4356 26.0603 13.3131 28.4223 13.3131L31.4346 13.3117V8.22391C30.9134 8.15484 29.1254 8 27.0451 8C22.702 8 19.7286 10.6509 19.7286 15.5194V19.7147H14.8164V25.4033H19.7285V40L25.6029 39.9998Z" fill="white"/>
						</svg>
					</a>
					<?php } ?>
					<?php if(get_sub_field('vk_link')) { ?>
					<a href="<?php echo get_sub_field('vk_link'); ?>">
						<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
							<rect width="48" height="48" rx="24" fill="#5181B8"/>
							<path fill-rule="evenodd" clip-rule="evenodd" d="M39.2658 16.5348C39.4884 15.7932 39.2658 15.248 38.2071 15.248H34.7062C33.816 15.248 33.4059 15.7189 33.1834 16.2383C33.1834 16.2383 31.403 20.5775 28.8809 23.3962C28.0649 24.2121 27.6941 24.4715 27.249 24.4715C27.0264 24.4715 26.7044 24.2121 26.7044 23.4705V16.5348C26.7044 15.6446 26.4461 15.248 25.7041 15.248H20.2028C19.6467 15.248 19.3121 15.6611 19.3121 16.0527C19.3121 16.8967 20.5729 17.0912 20.703 19.4648V24.6202C20.703 25.7505 20.4989 25.9555 20.0538 25.9555C18.867 25.9555 15.9804 21.5965 14.268 16.6091C13.9324 15.6396 13.5958 15.248 12.7011 15.248H9.20028C8.20005 15.248 8 15.7189 8 16.2383C8 17.1655 9.18703 21.7646 13.5263 27.847C16.4195 32.0005 20.4949 34.2525 24.2038 34.2525C26.4293 34.2525 26.7044 33.7524 26.7044 32.8909V29.7514C26.7044 28.7512 26.9152 28.5517 27.6196 28.5517C28.1392 28.5517 29.0292 28.8112 31.1064 30.8139C33.4799 33.1872 33.871 34.2525 35.2064 34.2525H38.7072C39.7074 34.2525 40.2075 33.7524 39.919 32.7654C39.6034 31.7817 38.4701 30.3548 36.9663 28.6629C36.1503 27.6985 34.9263 26.66 34.5557 26.1408C34.0363 25.4732 34.1846 25.1766 34.5557 24.5835C34.5557 24.5835 38.8207 18.5751 39.2658 16.5351V16.5348Z" fill="white"/>
						</svg>
					</a>
					<?php } ?>
					<?php if(get_sub_field('yt_link')) { ?>
					<a href="<?php echo get_sub_field('yt_link'); ?>">
						<svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
							<rect width="48" height="48" rx="24" fill="#FF0000"/>
							<path fill-rule="evenodd" clip-rule="evenodd" d="M35.7379 14.1401C37.0229 14.486 38.0361 15.4992 38.3821 16.7842C39.0246 19.1318 38.9999 24.0247 38.9999 24.0247C38.9999 24.0247 38.9999 28.8929 38.3821 31.2405C38.0361 32.5255 37.0229 33.5387 35.7379 33.8846C33.3903 34.5024 23.9999 34.5024 23.9999 34.5024C23.9999 34.5024 14.6342 34.5024 12.2619 33.8599C10.9769 33.5139 9.96375 32.5008 9.61779 31.2158C9 28.8929 9 24 9 24C9 24 9 19.1318 9.61779 16.7842C9.96375 15.4992 11.0016 14.4613 12.2619 14.1153C14.6095 13.4976 23.9999 13.4976 23.9999 13.4976C23.9999 13.4976 33.3903 13.4976 35.7379 14.1401ZM28.8187 24L21.0098 28.4975V19.5025L28.8187 24Z" fill="white"/>
						</svg>
					</a>
					<?php } ?>
					<?php } } ?>
				</div>
			</div>
		</div>
	</div>
</footer>
<div class="to_top">
	<svg xmlns="http://www.w3.org/2000/svg" width="73" height="73" viewBox="0 0 73 73" fill="none">
		<g filter="url(#filter0_d_762_4916)">
			<rect x="10" y="6" width="53" height="53" rx="9" fill="white"/>
		</g>
		<path d="M37.7071 24.2929C37.3166 23.9024 36.6834 23.9024 36.2929 24.2929L29.9289 30.6569C29.5384 31.0474 29.5384 31.6805 29.9289 32.0711C30.3195 32.4616 30.9526 32.4616 31.3431 32.0711L37 26.4142L42.6569 32.0711C43.0474 32.4616 43.6805 32.4616 44.0711 32.0711C44.4616 31.6805 44.4616 31.0474 44.0711 30.6569L37.7071 24.2929ZM38 42L38 25L36 25L36 42L38 42Z" fill="#1E1D25"/>
		<defs>
			<filter id="filter0_d_762_4916" x="0.5" y="0.5" width="72" height="72" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
				<feFlood flood-opacity="0" result="BackgroundImageFix"/>
				<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
				<feOffset dy="4"/>
				<feGaussianBlur stdDeviation="4.75"/>
				<feComposite in2="hardAlpha" operator="out"/>
				<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.1 0"/>
				<feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_762_4916"/>
				<feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_762_4916" result="shape"/>
			</filter>
		</defs>
	</svg>
</div>

</div><!-- #page -->
<?php get_template_part('templates/blocks/modal', 'result'); ?>
<div class="overlay"></div>
<?php wp_footer(); ?>

</body>
</html>
